# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [7]:
import sqlite3
import pandas as pd

In [8]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [9]:
c.execute('''select firstName, lastName from employees''').fetchall()

[('Diane', 'Murphy'),
 ('Mary', 'Patterson'),
 ('Jeff', 'Firrelli'),
 ('William', 'Patterson'),
 ('Gerard', 'Bondur'),
 ('Anthony', 'Bow'),
 ('Leslie', 'Jennings'),
 ('Leslie', 'Thompson'),
 ('Julie', 'Firrelli'),
 ('Steve', 'Patterson'),
 ('Foon Yue', 'Tseng'),
 ('George', 'Vanauf'),
 ('Loui', 'Bondur'),
 ('Gerard', 'Hernandez'),
 ('Pamela', 'Castillo'),
 ('Larry', 'Bott'),
 ('Barry', 'Jones'),
 ('Andy', 'Fixter'),
 ('Peter', 'Marsh'),
 ('Tom', 'King'),
 ('Mami', 'Nishi'),
 ('Yoshimi', 'Kato'),
 ('Martin', 'Gerard')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [10]:
c.execute('''select employees.officeCode, count(employees.officeCode) from employees join offices on offices.officeCode group by employees.officeCode''').fetchall()

[('1', 42), ('2', 14), ('3', 14), ('4', 35), ('5', 14), ('6', 28), ('7', 14)]

In [11]:
cur.execute("""select * from orderdetails
                        join products
                        on orderdetails.productCode = products.productCode
                        limit 10;
                       """)

NameError: name 'cur' is not defined

## Write 3 Questions of your own and answer them

In [ ]:
#in what cities are the most customers canceling their orders...top 5

In [ ]:
c.execute('''select status, city, count(city) 
            from orders 
            join customers 
            where status="Cancelled" 
            group by city 
            order by count(city) 
            desc limit 5''').fetchall()

In [ ]:
# Bottom five?

In [ ]:
c.execute('''select status, city, count(city) as "count" 
            from orders 
            join customers 
            where status="Cancelled" 
            group by city 
            order by count(city) 
             limit 50''').fetchall()

In [ ]:
#Average number of cancelled orders per city?
c.execute('''select count(city) as count, city as city 
            from orders 
            join customers 
            where status="Cancelled" 
            group by city 
            order by count(city) desc''').fetchall()

In [ ]:
c.execute('''select avg(a.count) from (select count(city) as count, city as city 
            from orders 
            join customers 
            where status="Cancelled" 
            group by city 
            order by count(city)) as a''').fetchall()

In [ ]:
SELECT 
  AVG(`count`)
FROM
  (SELECT 
    COUNT(s_id) AS `count`
  FROM
    instructor,
    advisor 
  WHERE instructor.ID = advisor.i_id 
    AND dept_name = 'CIS' 
  GROUP BY dept_name) nested ;

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
c.execute('''select products.productName from
                products join orderdetails on orderdetails.productCode
                join orders on orders.orderNumber
                join customers on customers.customerNumber
                join employees
                where customers.salesRepEmployeeNumber=employees.employeeNumber''').fetchall()

In [ ]:
# c.execute('''select products.productName from
#                 products full outer join orderdetails
#                 full outer join orders
#                 full outer join customers
#                 full outer join employees
#                 where customerbs.salesRepEmployeeNumber=employees.employeeNumber''').fetchall()

In [ ]:
# c.execute('''select products.productName from
#                 products right join orderdetails on orderdetails.productCode
#                 right join orders on orders.orderNumber
#                 right join customers on customers.customerNumber
#                 right join employees
#                 where customers.salesRepEmployeeNumber=employees.employeeNumber''').fetchall()

In [ ]:
# c.execute('''select employees.firstName, customers.addressLine1 from 
#              employees join customers join orders join orderdetails''').fetchall()

In [ ]:
c.execute('''SELECT COALESCE(MAX(orderNumber)+1, 0) FROM orders''').fetchall()

In [12]:
# c.execute('''select customers.addressLine1, orders.orderNumber 
#              from customers join orders
#              join orderdetails''').fetchall()

In [13]:
# c.execute('''SELECT employees.employeeNumber, productName.products''')

In [53]:
df = pd.DataFrame(c.execute('''select e.firstName, e.employeeNumber, orderdetails.priceEach, products.productName  
            from employees e join customers c 
            on e.employeeNumber = c.salesRepEmployeeNumber
            join orders o
            join orderdetails using(orderNumber)
            join products using(productCode)''').fetchall())
print(len(df))
df.head()

299600

        0     1       2                                    3
0  Leslie  1165  136.00             1917 Grand Touring Sedan
1  Leslie  1165   55.09                   1911 Ford Town Car
2  Leslie  1165   75.46  1932 Alfa Romeo 8C2300 Spider Sport
3  Leslie  1165   35.29     1936 Mercedes Benz 500k Roadster
4  Leslie  1165  136.00             1917 Grand Touring Sedan

In [54]:
# c.execute('''select e.firstName, e.employeeNumber, orderdetails.priceEach, products.productName  
#             from employees e join customers c 
#             on e.employeeNumber = c.salesRepEmployeeNumber
#             join orders o
#             join orderdetails using(orderNumber)
#             join products using(productCode)''').fetchall()

In [57]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [63]:
df.head()

        0     1       2                                    3
0  Leslie  1165  136.00             1917 Grand Touring Sedan
1  Leslie  1165   55.09                   1911 Ford Town Car
2  Leslie  1165   75.46  1932 Alfa Romeo 8C2300 Spider Sport
3  Leslie  1165   35.29     1936 Mercedes Benz 500k Roadster
4  Leslie  1165  136.00             1917 Grand Touring Sedan

In [66]:
df.groupby(0)[1]

In [62]:
df.groupby([0,1]).count()

                   2      3
0        1
Andy     1611  14980  14980
Barry    1504  26964  26964
Foon Yue 1286  20972  20972
George   1323  23968  23968
Gerard   1370  20972  20972
Julie    1188  17976  17976
Larry    1501  23968  23968
Leslie   1165  17976  17976
         1166  17976  17976
Loui     1337  17976  17976
Mami     1621  14980  14980
Martin   1702  17976  17976
Pamela   1401  29960  29960
Peter    1612  14980  14980
Steve    1216  17976  17976

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!